/**** FileVault Strings and Formatting *****/

/* The format string used to generate the text label that appears in the FileVault conversion progress window when it is showing the progress of a user's home folder getting encrypted.  The %@ is replaced by the user's full name. */
"ENCRYPTING_MESSAGE_FORMAT" = "Зашифровываю папку пользователя %@";

/* The format string used to generate the text label that appears in the FileVault conversion progress window when it is showing the progress of a user's home folder getting decrypted.  The %@ is replaced by the user's full name. */
"DECRYPTING_MESSAGE_FORMAT" = "Расшифровываю папку пользователя %@";

/* The format string used to generate the text label that appears in the FileVault progress window when it is showing the progress of a user's home folder getting compacted.  The %@ is replaced by the user's full name. */
"COMPACTING_MESSAGE_FORMAT" = "Восстанавливаю дисковое пространство в папке пользователя %@";

/* The format string used to generate the text label that appears in the FileVault progress window when it is showing the progress of a user's home folder being backed up by TimeMachine.  The %@ is replaced by the user's full name. */
"BACKINGUP_MESSAGE_FORMAT" = "Резервное копирование папки пользователя %@";

"CONVERTING_MESSAGE_FORMAT" = "Конвертирую папку пользователя %@";

/* The following strings appear below the progress bar in the FileVault conversion progress window to indicate the various phases of the conversion process. */
"PHASE_PREPARING" = "Готовлю...";
"PHASE_CREATING_IMAGE" = "Создаю FileVault...";
"PHASE_MOUNTING_IMAGE" = "Подключаю FileVault...";
"PHASE_COPYING_TO_IMAGE" = "Копирую содержимое папки пользователя в FileVault...";
"PHASE_COPY_COMPLETE" = "Копирование завершено...";
"PHASE_UPDATING_USER_RECORD" = "Обновляю запись пользователя...";
"PHASE_UNMOUNTING_IMAGE" = "Отключаю FileVault...";
"PHASE_DELETING_OLD_HOME" = "Удаляю старую папку пользователя...";
"PHASE_SECURE_ERASING_OLD_HOME" = "Безопасное стирание предыдущей папки пользователя…";
"PHASE_CANCELLING" = "Отменяю...";
"PHASE_PAUSED" = "Пауза";
"PHASE_COMPACTING" = "Восстанавливаю пространство на диске...";
"PHASE_BACKINGUP" = "Создаю резервную копию…";

/* The following strings are time estimates that appear below the progress bar in the FileVault conversion progress window */
"TIME_EST_ESTIMATING" = "Оцениваю...";
"TIME_EST_ABOUT_5_SECONDS" = "Примерно 5 с.";
"TIME_EST_ABOUT_10_SECONDS" = "Примерно 10 с.";
"TIME_EST_UNDER_A_MINUTE" = "Меньше минуты";
"TIME_EST_ABOUT_A_MINUTE" = "Примерно 1 мин.";
"TIME_EST_ABOUT_N_MINUTES" = "Примерно %d мин.";
"TIME_EST_ABOUT_ONE_HOUR" = "Около 1 ч.";
"TIME_EST_ABOUT_ONE_HOUR_N_MINUTES" = "Около 1 ч. и %d мин.";
"TIME_EST_ABOUT_PLURAL_HOURS" = "Около %d ч.";
"TIME_EST_ABOUT_PLURAL_HOURS_PLURAL_MINUTES" = "Около %1$d ч. и %2$d мин.";


"TIME_REMAINING_FORMAT" = "Времени осталось: %@";
"CANCEL_BUTTON_LABEL" = "Отменить";

/* The following strings are used to construct the confirmation alert that is presented when a user clicks the Cancel button in the FileVault progress window. */

"CANCEL_CONFIRMATION_STOP_BUTTON" = "Стоп";
"CANCEL_CONFIRMATION_CONTINUE_BUTTON" = "Продолжить";
"CANCEL_ENCRYPT_CONFIRMATION_MESSAGE" = "Вы действительно хотите остановить FileVault?";
"CANCEL_ENCRYPT_CONFIRMATION_INFO" = "Защита FileVault еще не закончила шифровку этой папки пользователя. Если остановить расшифровку сейчас, защита FileVault останется выключенной, а папка зашифрована не будет.";
"CANCEL_DECRYPT_CONFIRMATION_MESSAGE" = "Вы действительно хотите остановить FileVault?";
"CANCEL_DECRYPT_CONFIRMATION_INFO" = "Защита FileVault еще не закончила расшифровку этой папки пользователя. Если остановить расшифровку сейчас, защита FileVault останется включенной, а папка – зашифрованной.";

/* The following strings are used to construct the confirmation alert that is presented when a user when a compact is necessary during log out. */

"COMPACT_CONFIRMATION_CONTINUE_BUTTON" = "Продолжить";
"COMPACT_CONFIRMATION_SKIP_NOW_BUTTON" = "Пропустить";

"COMPACT_CONFIRMATION_MESSAGE" = "Ваша папка пользователя, защищенная FileVault, занимает больше места, чем необходимо. FileVault восстановит это пространство на диске. Хотите продолжить?";

"COMPACT_CONFIRMATION_INFO" = "Если нажать «Продолжить», FileVault восстановит неиспользуемое пространство на диске. Хотя этот процесс займет некоторое время, рекомендуется провести восстановление прямо сейчас.";


/* Error Alert strings */
"FV_ERROR_OK_BUTTON" = "OK";
"FV_ERROR_TITLE" = "Произошла ошибка";
"FILEVAULT_ENCRYPT_ERROR_MESSAGE" = "Произошла ошибка в ходе шифровки (%@). Защита FileVault не будет включена для этой учетной записи.";
"FILEVAULT_DECRYPT_ERROR_MESSAGE" = "Произошла ошибка в ходе расшифровки (%@). Защита FileVault не будет выключена для этой учетной записи.";
"FV_COULD_NOT_CREATE_IMAGE" = "Не могу создать образ диска FileVault";
"FV_COULD_NOT_CREATE_MOUNT_POINT_DIR" = "Не могу создать временную точку подключения";
"FV_COULD_NOT_MOUNT_IMAGE_FOR_COPYING" = "Не могу подключить образ диска FileVault для копирования";
"FV_ERROR_OCCURRED_DURING_COPY" = "При копировании произошла ошибка.";
"FV_COULD_NOT_MOUNT_IMAGE_FOR_VERIFICATION" = "Не могу подключить образ диска FileVault для проверки";
"FV_VERIFICATION_FAILED" = "Проверка не удалась";
"FV_COULD_NOT_UNMOUNT_IMAGE" = "Не удалось отключить образ диска FileVault";
"FV_ERROR_DEFAULT" = "Ошибка %d";

"FV_SECURE_ERASE_FINISHED_TITLE" = "Ваша предыдущая папка пользователя была успешно стерта.";
"FV_SECURE_ERASE_FINISHED_INFO" = "Защита FileVault для Вашей учетной записи теперь включена, а содержимое папки пользователя зашифровано.";
"FV_SECURE_ERASE_FAILED_TITLE" = "Возникала проблема безопасного стирания предыдущей папки пользователя в процессе преобразования FileVault.";
"FV_SECURE_ERASE_FAILED_INFO" = "Произошел сбой процесса безопасного стирания, прежде чем предыдущая папка пользователя была полностью стерта.";
"FV_CONTINUE_TITLE" = "Вы действительно хотите продолжить стирание предыдущей папки пользователя в фоновом режиме?";
"FV_CONTINUE_INFO" = "Если Вы нажмете «OK», FIleVault завершит безопасное стирание Вашей предыдущей папки пользователя, пока Вы продолжаете работать. Чтобы проверить статус процесса стирания, откройте панель «Безопасность» в Системных настройках.";